## Create a DataFrame from List

In [ ]:
import pandas as pd

In [84]:
def dfs(student_data):
    df = pd.DataFrame(student_data)
    df.columns=['student_id','age']
    return df
data = dfs(student_data=[
  [1, 15],
  [2, 11],
  [3, 11],
  [4, 20],
[1, 151],
[4,]])
print(data)

   student_id    age
0           1   15.0
1           2   11.0
2           3   11.0
3           4   20.0
4           1  151.0
5           4    NaN

## Get the Size of a DataFrame

In [38]:
print([data.shape[0],data.shape[1]])

[4, 2]

## Display the First Three Rows

In [39]:
print(data[0:3])

   student_id  age
0           1   15
1           2   11
2           3   11

## Select Data

In [64]:
print(data.loc[data['student_id']==1,'student_id'])

0    1
Name: student_id, dtype: int64

## Create a New Column

In [66]:
data['bonus'] = data['age']+data['age']
print(data)

   student_id  age  bonus
0           1   15    225
1           2   11    121
2           3   11    121
3           4   20    400

##  Drop Duplicate Rows

In [75]:
data.drop_duplicates(subset="student_id")

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20

## Drop Missing Data

In [77]:
data.dropna(subset='age')

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20
4           1  151

## Modify Columns

In [78]:
data['age'] = data['age']*2
data

   student_id  age
0           1   30
1           2   22
2           3   22
3           4   40
4           1  302

## Rename Columns

In [85]:
data.rename(columns={'student_id':'id','age':'Age'},inplace=True)

## Change Data Type

In [83]:
data['Age'].astype(int)

0     30
1     22
2     22
3     40
4    302
Name: Age, dtype: int32

## Filling Missing Data

In [87]:
data['Age'].fillna(0)

0     15.0
1     11.0
2     11.0
3     20.0
4    151.0
5      0.0
Name: Age, dtype: float64

## Reshape Data: Concatenate

In [92]:
data2 = dfs(student_data=[
  [1, 34],
  [2, 45],
  [3, 121],
  [4, 20]])
data2.rename(columns={'student_id':'id','age':'Age'},inplace=True)

In [93]:
pd.concat([data,data2])

   id    Age
0   1   15.0
1   2   11.0
2   3   11.0
3   4   20.0
4   1  151.0
5   4    NaN
0   1   34.0
1   2   45.0
2   3  121.0
3   4   20.0